# Rebar Free Form Creation Result Dispose Method

Source: https://www.revitapidocs.com/2026/88f40fec-f722-78fd-24d4-f5091a573d8c.htm

---

| Rebar Free Form Creation Result Dispose Method |
| --- |

Releases all resources used by the RebarFreeFormCreationResult
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace